import { Helmet } from 'react-helmet';

const Daoqian = () => {
  return (
    <>
      <Helmet>
        <link rel="stylesheet" href="./css/daoqian.css"></link>
      </Helmet>
      <div className="daoqian">
        <h1>对不起你千万次</h1>
        <p>
          我错了，错的事离谱至极，我最近一直在反思我的为人处世和我的行为，我是多么的愚蠢，多么的自傲，可又多么的自卑，我会愚蠢到和即将步入婚姻的人大摆可笑又自以为行得通的道理，让你身心俱疲，在你生日快来的时候，我做了什么狗屁事情，真的是活生生的畜生行为，要是在新闻上看到，活该会被千夫所指，会被贻笑大方。
        </p>
        <p>
          最近的日子里，我早上起来，都会想是不是做了个噩梦，这一切都是我自找的，我活该被惩罚，我是什么东西，怎么就最基本的交流都不会，一股恼什么难听的话都说出口，我真的是欠打欠骂，你消消气不要在气头上，生气对你的身子不好，我明知道你情绪不稳定，身体就会吃不消，还跟你狡辩，我真的是该死，太不成气候了，你的指责是对的。
        </p>
        <p>
          我真真正正地知道错了，我没有考虑过你半点的感受，在我说出话之前，我没有把你带入到语境里，把你的感受统统抛向脑后，自以为没有错的可笑立场让你受到了莫名的攻击，让我心爱的人伤心我是太傻X了，我这几天无有一刻不在悔恨的自己失礼行为，想到你受到的我的语言攻击，我真的是活该被所有人唾弃，我还可笑的自以为是，觉得自己有理。我完全没有做好一个合格另一半的准备和姿态。千错万错，都是我的错，我的愚蠢，自大和自卑让你受到了莫名无比的伤害。我深刻痛彻总结我的过失，我向你发誓，我再也不会和你提起那些因为我的自卑产生的问题只字片语，绝不会跟你争吵半分，我会事事过脑子考虑后果之后再发言，服从你的开导，因为只有你是真正为我着想的，我要跨出我的自卑圈，我要给你带来阳光和安稳。
        </p>
        <p>
          言语是一把无形的利刃，我亲手把利刃插进你的心里，受伤的心不会立刻就会恢复，我奢求你能留给我一个转变的机会，我会证明给你看我的成长，我会接收你所有的指正，绝无怨言。没有把握住你这么优秀的女孩子，是我用一辈子来后悔的，恳求你给我留一条门缝可以吗，哪怕是平日向你问好也可以，不奢求你立马回复，只求不要和你陌路，我对你的爱意从来没有变过，因为真的爱你，所以不想放手，请给我认错的机会，这次的贸然举动是我百口莫辩，放一百万次一亿次都是我的错，如果我还有救，我会一直向你认错，直到你气消了我在正式向你当面认错，你是我这辈子真心想要一起走下去的人，为了你我会做出任何改变，对不起对不起对不起，我会当面向你谢罪的，请你原谅我，我是脑子秀逗了跟你吵架，以后绝对绝对不会有第二次了。我绝对不是在装做样子骗你，我是真心实意的向你认错。
        </p>
      </div>
    </>
  );
};

export default Daoqian;
