import TypeWriterEffect from 'react-typewriter-effect';

const LoverLetterContent = () => {
    return<>
        <TypeWriterEffect
        textStyle={{
        color: 'white',
        fontWeight: 500,
        fontSize: '1em',
        textAlign: 'center',
        backgroundColor: '#00000073'
        }}
        startDelay={500}
        cursorColor="#3F3D56"
        multiText={[
        '写给我今生最爱的振华'
        ]}
        typeSpeed={100}
        hideCursorAfterText={true}
    />
    <br />
        <TypeWriterEffect
        textStyle={{
        color: 'white',
        fontWeight: 500,
        fontSize: '1em',
        textAlign: 'center',
        backgroundColor: '#00000073'
        }}
        startDelay={4000}
        cursorColor="#3F3D56"
        multiText={[
        '我自打看到你照片的第一时刻，我就知道我已经沦陷了!还记得那是去年3.15，我还在上班突然街道姑姑的短信，问想不想认识女朋友，这是我第一次被别人介绍女朋友，虽然有点不知所措但还是有点期待的，我看到你的照片后我就觉得你就是那个我一直在等待的那个人。晚上我鼓起勇气，加了你的微信好友，你还记得吗？我们第一次打招呼，你说"안녕하세요 리진화 라고 합니다" 我用我蹩脚的朝文回复你"우후~ 안녕하세요 리언봉 임다" 不知道我傻了呵的打了个呜呼，可能我真的太紧张也太激动了吧，你给我的第一感觉是不拘谨，懂得礼仪，温文尔雅，第一天我们就聊到了快12点多，你跟我分享了在日本的总总趣闻，给我发了回转寿司的影像, 富士山的照片，我们互相隔着大海分享着以前的经历，现在想起来，我是从那天开始就叫你大佬/大哥的，我拜托大佬以后带我去日本开眼界，你酷酷的给我发了一个ok的表情包，一个肉肉的小手。想想这些话题仿佛近日，但已经快要一年多了，我们虽然身在异国，但是我对你的向往和喜好一直是近在咫尺的。谢谢你这么长时间能不嫌弃我的不善言辞，依旧不舍的左右在身边，虽然可能你已经听腻了，但是认识你的的确确是我这辈子在等待的事，能跟你在一起肯定了是我这辈子该去追求的事。疫情严重期间，我顾虑总总不方便回国，之后跟你聊起才知道你有多么不舒服，我的举动是那么自私想要你来我却不回去，感谢你能谅解这样的我。 我跟你在一起的时光，我的生活里有了一个可以分享日常，敞心开玩笑，畅想未来的一个暖心角落，每天早上起来想到远方还有一个你我就幸福感满满，活力十足, 有你的日子，我的生活多了一份温馨和快乐，我们以后可以做好多好多的事情，留下好多好多的回忆来弥补一直以来见不到面的遗憾。你坚强的性格也是深深吸引我的千万魅力之一，敬仰的同时激起了我对你的保护欲，你自己一个人拔智齿，你自己一个人去医院看病，去忙上忙下，这些我现在想想都心疼悔恨，你该是多么需要有一个人在你旁边分担一些疲劳，我心里决定以后用实际行动百般呵护你，百般宠爱你，再也不让你一个人面对艰难的事情，再也不让你受委屈。从前车马很慢，书信很远，一生只够爱一人，现在繁花似锦，却人心渐远，一生只愿爱一人，我向你保证过的，约定过的，还有未来没来得及许诺的，一切的一切我都会一一兑现，作为一个男人，绝对不会在一个地方犯两回错，路遥知马力日久见人心，我会用行动来证明我的爱是千真万确，我的爱是至死不渝，我的爱只是属于你一个人的。你我的世界，只限于微信的对话，对你的思念，却是源源不绝, 请把你的心托付给我，我会和我的心放在一起无论世事如何变迁都无法转变我的信念，因为我已把我的心交托给你。等我们老了的时候，和你一起，在远处的海边小镇，安静的住下，早上看海边日出，晚上捧着热茶一起看夕阳，有你的存在，生命才会完满。'
        ]}
        multiTextDelay={4000}
        typeSpeed={70}
    />
  </> 
  };
  
export default LoverLetterContent;
